#include <iostream>

int main() {
    
    return 0;
}

/*
Что нужно сделать
В древности для шифрования сообщений использовался такой способ:
все буквы в сообщении сдвигались на одно и то же число позиций в алфавите.
Число позиций могло быть как положительным, так и отрицательным и являлось
параметром шифра. Если для сдвига на данное число позиций алфавита не хватает,
то он зацикливается (то есть буква с номером 27 — это снова буква «a», буква
с номером 28 — это «b» и так далее).

Например, слово abracadabra при сдвиге на 10 позиций превратится в klbkmknklbk.
Этот простейший шифр называется шифром Цезаря. Регистр букв (заглавные и строчные) менять не нужно.
Напишите функцию encrypt_caesar от строки и числа, которая возвращает исходную строку, зашифрованную шифром Цезаря с
параметром, равным данному числу. Также напишите функцию decrypt_caesar, выполняющую обратное преобразование.
Считаем, что входные строки состоят лишь из английских букв; если там содержатся и другие символы, то их надо игнорировать.
*/