#include <iostream>

int main() {
    
}

/*
Проверьте, задаёт ли введённая пользователем строка корректный IP-адрес четвёртой версии (IPv4). 
IP-адрес должен представлять из себя четыре числа, разделённые точками 
без пробелов, причём каждое число должно быть в диапазоне от 0 до 255 включительно. 
Числа не должны содержать ведущих нулей. Других символов в строке, 
кроме вышеописанных, присутствовать не должно.
Пользователь вводит строку, задающую ip-адрес. 
Программа должна вывести слово Yes, если адрес 
корректен, и слово No, если это не так.
*/